---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantEditWhileGrouped
source: html/02cc71f0-8352-76de-4b23-9476a21f93bb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantEditWhileGrouped Property

You may not edit this parameter while the element is grouped.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantEditWhileGrouped { get; }
```